In [1]:
import pandas as pd

In [2]:
data = {'col1':[1,2,3,4],'col2':[5,6,7,8]}
df = pd.DataFrame(data)
df

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [3]:
def double_values(x):
    return 2*x

In [5]:
df.apply(double_values)

   col1  col2
0     2    10
1     4    12
2     6    14
3     8    16

In [6]:
square = lambda x: x**2

In [7]:
df

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [10]:
df['squared_column_1'] = df['col1'].apply(lambda x: x**2)

In [11]:
df

   col1  col2  squared_column  squared_column_1
0     1     5               1                 1
1     2     6               4                 4
2     3     7               9                 9
3     4     8              16                16

In [ ]:
df.drop(columns=[])